"""Задача 3. Перевод целого числа в римское число"""
'''Программа принимает целое число и возвращает его римское представление в
виде строки.'''

num = int(input("Введите целое число: "))

val = [1000, 900, 500, 400, 100, 90, 50, 40, 10, 9, 5, 4, 1]
syb = ['M', 'CM', 'D', 'CD', 'C', 'XC', 'L', 'XL', 'X', 'IX', 'V', 'IV', 'I']

roman_num = ''
i = 0
while num > 0:
    for _ in range(num // val[i]):
        roman_num += syb[i]
        num -= val[i]
    i += 1
print("Результат:", roman_num)
